app/views/users/show.html.haml

SELECT `applies`.* FROM `applies` WHERE `applies`.`user_id` = 2
---
      %ul.more_list
      - current_user.applies.each do |apply|