app/controllers/applies_controller.rb

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 16 LIMIT 1
---
  def new
    @offer = Offer.find(params[:offer_id])

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = NULL LIMIT 1
INSERT INTO `applies` (`offer_id`, `user_id`, `created_at`, `updated_at`) VALUES (16, 1, '2017-05-16 05:58:55', '2017-05-16 05:58:55')
---
  def create
    @offer = Offer.find(params[:offer_id])
    @apply = Apply.new(offer_id: apply_params[:offer_id], user_id: current_user.id)
    if @apply.save