app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(text: comment_params[:text], offer_id: comment_params[:offer_id], user_id: current_user.id)
---
INSERT INTO `comments` (`user_id`, `offer_id`, `text`, `created_at`, `updated_at`) VALUES (1, 17, 'テストや!!\r\n', '2017-05-19 09:04:27', '2017-05-19 09:04:27')