app/controllers/companies_controller.rb

  def show
    @company = Company.find(params[:id])
    @offers = Offer.where(company_id: @company.id)
    @applies = Apply.where(company_id: @company.id)
---
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 ORDER BY `companies`.`id` ASC LIMIT 1
SELECT `offers`.* FROM `offers` WHERE `offers`.`company_id` = 1
SELECT `applies`.* FROM `applies` WHERE `applies`.`company_id` = 1