app/controllers/offers_controller.rb

  def index
    @offers = Offer.all
---
SELECT `offers`.* FROM `offers`