app/controllers/offers_controller.rb

SELECT  `offers`.* FROM `offers` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `offers`
---
  def index
    @offers = Offer.order("created_at DESC").page(params[:page]).per(5)

INSERT INTO `offers` (`company_id`, `title`, `image`, `what`, `why`, `how`, `created_at`, `updated_at`) VALUES (1, '健康志向　未来の星', 'IMG_2519.JPG', '野球関係', '甲子園を目指して', '朝から練習', '2017-05-16 06:49:40', '2017-05-16 06:49:40')
---
  def create
    @offer = current_company.offers.new(offer_params)
    if @offer.save

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 10 LIMIT 1
DELETE FROM `offers` WHERE `offers`.`id` = 10
---
  def destroy
    offer = Offer.find(params[:id])
    offer.destroy if offer.company_id == current_company.id

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 2 LIMIT 1
---
  def edit
    @offer = Offer.find(params[:id])

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 17 LIMIT 1
UPDATE `offers` SET `what` = '野球関係のお仕事', `updated_at` = '2017-05-17 05:58:46' WHERE `offers`.`id` = 17
---
  def update
    offer = Offer.find(params[:id])
    if offer.company_id == current_company.id
      offer.update(offer_params)

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 8 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`offer_id` = 18
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 ORDER BY `companies`.`id` ASC LIMIT 1
SELECT `replies`.* FROM `replies` WHERE `replies`.`offer_id` = 18
---
  def show
    @offer = Offer.find(params[:id])
    @offer_id = Offer.find(params[:id]).id
    @apply = Apply.new
    @comments = @offer.comments.includes(:user)
    @replies = @offer.replies.includes(:company)

SELECT  `offers`.* FROM `offers` WHERE `offers`.`id` = 17 LIMIT 1
SELECT `applies`.* FROM `applies` WHERE `applies`.`offer_id` = 17
---
  def situation
    @offer = Offer.find(params[:id])
    @applies = Apply.where(offer_id: @offer.id)