app/controllers/replies_controller.rb

INSERT INTO `replies` (`company_id`, `offer_id`, `text`, `created_at`, `updated_at`) VALUES (1, 18, '確認', '2017-05-20 05:20:42', '2017-05-20 05:20:42')
---
  def create
     @reply = Reply.create(text: reply_params[:text], offer_id: reply_params[:offer_id], company_id: current_company.id)