app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `applies`.* FROM `applies` WHERE `applies`.`user_id` = 2
---
  def show
    @user = User.find(params[:id])
    @applies = Applies.where(user_id: @user.id)